mysource/public-notes-org/2022-09-30-different-SSH-identities-for-different-repos.org
#+TITLE: How to setup different SSH identities for different github/gitlab accounts
#+DESCRIPTION: 
#+AUTHOR: cissic
#+DATE: <2022-09-30 Fri>
#+TAGS: git ssh-agent ssh-add

** How to setup different SSH identities for different github/gitlab accounts

*** Solution

Solution can be found [[https://gist.github.com/cissic/fc81bece710dded457d230837b2139e1][here]].

After following the instructions from the link *remember* to clone the repository with the appropriate host name from =~/.ssh/config=!


**** Example
Assuming that content of the ~/.ssh/config is:

#+begin_example
# First (default) github account
Host github.com
    HostName github.com
    Preferredauthentications publickey
    IdentityFile ~/.ssh/identityA

Host userB.github.com
    HostName github.com
    Preferredauthentications publickey
    IdentityFile ~/.ssh/identityB
#+end_example

if you want to clone repository as =userB= *do not* simply =git clone= the link copied with the use of GitHub interface i.e.:
#+begin_example
# (DON'T DO THAT unless you want to clone with your default identity): 
# git clone git@github.com:userB/repository-name.git 
#+end_example
You need to edit host name which for this example means you need to add *userB.* to the hostname:
#+begin_example
git clone git@userB.github.com:userB/repository-name.git
#+end_example

Now when pushing to =repository-name= you will be identified with the proper credentials of userB.

